//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Nome d'usuariu o contraseña non válidos";
"_cancelled_by_user"                    = "Encaboxóse la tresferencia";
"_error_folder_destiny_is_the_same_"    = "It is not possible to move the folder into itself";
"_error_not_permission_"                = "Nun tienes permitu pa completar la operación";
"_error_path_"                          = "Nun pue abirse esti ficheru o carpeta. Asegúrate qu'esiste, por favor";
"_file_upload_not_exitst_"              = "The file that you want to upload does not exist";
"_forbidden_characters_from_server_"    = "El nome contién polo menos un caráuter non válidu";
"_not_connected_internet_"              = "Fallu de conexón del sirvidor";
"_not_possible_connect_to_server_"      = "Nesti momentu nun ye posible coneutase col sirvidor";
"_not_possible_create_folder_"          = "Nun pudo crease la carpeta";
"_server_down_"                         = "Could not establish contact with server";
"_time_out_"                            = "Escosó'l tiempu, volvi tentalo";
"_unknow_response_server_"              = "Rempuesta inesperada del sirvidor";
"_user_autentication_required_"         = "Ríquese l'autenticación del usuariu";
"_file_directory_locked_"               = "Ficheru o direutoriu bloquiáu";
"_ssl_certificate_untrusted_"           = "El certificáu pa esti sirvidor nun ye válidu";
"_internal_server_"                     = "Internal server error";
"_file_already_exists_"                 = "Could not complete the operation, a file with the same name exists";
"_file_folder_not_exists_"              = "El ficheru fonte nun s'alcontró nel camín especificáu";
"_folder_contents_nochanged_"           = "Los conteníos de la carpeta nun camudaron";
"_images_invalid_converted_"            = "La imaxe nun ye válida y nun pue convertise nuna miniatura";
"_method_not_expected_"                 = "Unexpected request method";
"_reauthenticate_user_"                 = "Access expired, log in again";
"_server_error_retry_"                  = "El sirvidor ta temporalmente non disponible";
"_too_many_files_"                      = "Too many files would be involved in this operation";
"_too_many_request_"                    = "Sending too many requests caused the rate limit to be reached";
"_user_over_quota_"                     = "Algamóse la cuota d'almacenamientu";
"_ssl_connection_error_"                = "Fallu de conexón SSL, volvi tentalo";
"_bad_request_"                         = "Bad request";
"_webdav_locked_"                       = "WebDAV Locked: Trying to access locked resource";
"_error_user_not_available_"            = "The user is no longer available";
"_server_response_error_"               = "Server response content error";


